run/trackWeld/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    ymax
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       69400;
    }
    xmin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       70200;
    }
    xmax
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       71400;
    }
    ymin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       72600;
    }
    zmin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       73400;
    }
    zmax
    {
        type            patch;
        nFaces          600;
        startFace       74000;
    }
)

// ************************************************************************* //
